@echo off

echo ===========================
echo ==-- Ninja Service %~1 --==
echo ===========================
echo.

echo --== УПРАВЛЕНИЕ ==-
echo [1] Установить в автозапуск
echo [2] Удалить из автозапуска
echo [3] Проверить статус
echo [4] Провести диагностику
echo.

echo --== НАСТРОЙКИ ==--
echo [5] Изменить ipset        -> [ %~2 ]
echo [6] Изменить GameFilter   -> [ %~3 ]
echo.

echo --== ОБНОВЛЕНИЯ ==--
echo [7] Обновить листы ipset
echo [8] Обновить листы hosts
echo [9] Авто-поиск конфига
echo [10] Обновить тему

echo.
set /p menu_choice=Ваш выбор: 